results/finalTests/100_connections/Q2R.out
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

DB SCHEMA public
1
DB SCHEMA public
0
DB SCHEMA public
3
DB SCHEMA public
6
DB SCHEMA public
5
DB SCHEMA public
7
DB SCHEMA public
9
DB SCHEMA public
2
DB SCHEMA public
11
DB SCHEMA public
DB SCHEMA public
8
DB SCHEMA public
10
4
DB SCHEMA public
12
DB SCHEMA public
13
DB SCHEMA public
15
DB SCHEMA public
14
DB SCHEMA public
18
DB SCHEMA public
17
DB SCHEMA public
27
DB SCHEMA public
16
DB SCHEMA public
24
DB SCHEMA public
22
DB SCHEMA public
19
DB SCHEMA public
23
DB SCHEMA public
21
DB SCHEMA public
20
DB SCHEMA public
26
DB SCHEMA public
DB SCHEMA public
29
DB SCHEMA public
30
25
DB SCHEMA public
32DB SCHEMA public

31
DB SCHEMA public
28
DB SCHEMA public
34
DB SCHEMA public
38
DB SCHEMA public
33
DB SCHEMA public
39
DB SCHEMA public
35
DB SCHEMA public
37
DB SCHEMA public
36
DB SCHEMA public
42
DB SCHEMA public
41
DB SCHEMA public
46
DB SCHEMA public
DB SCHEMA public
45
40
DB SCHEMA public
43
DB SCHEMA public
44
DB SCHEMA public
47
DB SCHEMA public
48
DB SCHEMA public
50
DB SCHEMA public
49
DB SCHEMA public
54
DB SCHEMA public
51
DB SCHEMA public
52
DB SCHEMA public
53
DB SCHEMA public
58
DB SCHEMA public
57
DB SCHEMA public
56
DB SCHEMA public
59
DB SCHEMA public
61
DB SCHEMA public
55
DB SCHEMA public
60
DB SCHEMA public
63
DB SCHEMA public
65
DB SCHEMA public
62
DB SCHEMA public
64
DB SCHEMA public
69
DB SCHEMA public
68
DB SCHEMA public
66
DB SCHEMA public
67
DB SCHEMA public
70
DB SCHEMA public
73
DB SCHEMA public
75
DB SCHEMA public
DB SCHEMA public
71
77
DB SCHEMA public
72
DB SCHEMA public
74
DB SCHEMA public
79
DB SCHEMA public
78
DB SCHEMA public
84
DB SCHEMA public
80
DB SCHEMA public
83
DB SCHEMA public
76
DB SCHEMA public
81
DB SCHEMA public
87
DB SCHEMA public
85
DB SCHEMA public
86
DB SCHEMA public
DB SCHEMA public
91
92
DB SCHEMA public
89
DB SCHEMA public
82
DB SCHEMA public
94
DB SCHEMA public
88
DB SCHEMA public
93
DB SCHEMA public
DB SCHEMA public
95
90
DB SCHEMA public
97
DB SCHEMA public
99
DB SCHEMA public
98
DB SCHEMA public
96
Threads started!

SQL statistics:
    queries performed:
        read:                            18541
        write:                           18810
        other:                           3236
        total:                           40587
    transactions:                        1623   (1.98 per sec.)
    queries:                             40587  (49.46 per sec.)
    ignored errors:                      9      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          820.6596s
    total number of events:              1623

Latency (ms):
         min:                                    1.65
         avg:                                42857.86
         max:                               406665.45
         95th percentile:                   100000.00
         sum:                             69558308.59

Threads fairness:
    events (avg/stddev):           16.2300/3.95
    execution time (avg/stddev):   695.5831/48.97